import Navbar from '../../components/Navbar'
import Footer from '../../components/Footer'
import Image from 'next/image'

export default function BlogKMITL() {
    return (
        <div className='font-sarabun'>
            <Navbar />
            <div className='flex flex-col mx-5 xl:mx-80 lg:mx-40 md:mx-20 py-10 gap-5'>
                <h1 className='font-bold text-3xl pt-4'>รีวิวสัมภาษณ์ วิทย์คอม KMITL #dek68</h1>
                <p className='text-sm pb-2'>แก้ไขล่าสุด 8 พ.ย. 2567</p>
                <p className='text-lg'>เราสมัครในโครงการความสามารถพิเศษมานะ เขาเปิดรับตั้งแต่วันที่ 4 ก.ย.-16 ต.ค. แต่นี่รีบเลยสมัครตั้งแต่วันที่ 10 ก.ย. เลย ซึ่งยื่นพอร์ตผ่าน google form ไปตอนช่วงเที่ยงๆ ตอนเย็นเข้าไปเช็คฟอร์มใหม่ปรากฎว่าฟอร์มเหมือนจะรีเซ็ตเลยคิดว่าอาจจะลืมกดส่งเลยโทรไปถามคณะ!! ว่าเจอแบบตอบรับมั้ย เลขที่ xxx คณะก็ตอบว่าเจออยู่ เลยโล่งใจ หลายวันต่อมา มาอ่านใหม่ปรากฎว่าลืมเซ็นต์สำเนาถูกต้องในใบ ปพ. เลยโทรไปถามคณะอีกรอบ คณะก็บอกว่าไม่เป็นไร</p>
                <p className='text-lg'>29 ต.ค. ก็ถึงวันประกาศชื่อผู้มีสิทธิ์สอบสัมภาษณ์ มีแอบลุ้นนิดหน่อยแต่ก็มีชื่อ ซึ่งเรียกทั้งหมด195คน แต่รับแค่25คนตอนนั้นตกใจมาก แต่ก็ทำใจแล้วก็รีบเตรียมเอกสาร เพราะสัมภาษณ์วันที่ 2 พ.ย. คือสัมภาษณ์เร็วมากก เตรียมเอกสารแทบไม่ทัน</p>
                <p className='text-lg'>2 พ.ย. วันสัมภาษณ์ เรามาจากต่างจังหวัดถึงตอนประมาณตี 4 แล้วก็อาบน้ำที่ศูนย์นครชัยแอร์แล้วไปที่ สจล. เลย คือสู้ชีวิตมากก ไปถึงก็เจอผู้คนมากมายอยู่ในคณะ มีทั้งนักเรียนแล้วก็ผปค. เราได้สัมภาษณ์รอบแรกเลย 08.30 - 10.00 พอเวลา 08.00 พี่สตาฟก็ให้เข้าแถวแยกสาขาแล้วก็เดินขึ้นไปบนห้องรับรองเพื่อลงทะเบียนแล้วก็รอสัมภาษณ์โดยเรียกตามลำดับ</p>
                <div>
                    <Image src="https://i.ibb.co/3Rq4Kwt/11.jpg" alt='11'/>

                    <p className='text-center pt-2 text-gray-600 text-sm'>อันนี้เป็นบรรยากาศก่อนเข้าไปที่ห้องรับรองครับ</p>
                </div>
                <div>
                    <Image src="https://i.ibb.co/sshBy84/12.jpg" alt='12'/>
                    <p className='text-center pt-2 text-gray-600 text-sm'>อันนี้ก็เป็นบรรยากาศในห้องรับรอง</p>
                </div>
                <p className='text-lg'>ช็อค! สัมภาษณ์ในห้องประชุมใหญ่รวมหมดเลย ตอนนั้นคือโล่งแล้วเพราะว่าอาจจะไม่ค่อยกดดันเท่าไหร่แล้วก็มีหลายโต๊ะสัมภาษณ์พร้อมๆกัน อย่างที่บอกไปว่าเรายื่นในโครงการความสามารถพิเศษ ต้องสัมภาษณ์กับอาจารย์ผู้ชายมีอยู่2โต๊ะ เท่าที่มองดูเหมือนอาจารย์ค่อนข้างใจดียิ้มแย้ม คุยปกติเลย แต่ๆๆ โครงการความสามารถพิเศษผู้สมัครเยอะมาก บางคนเลยได้ไปสัมภาษณ์กับโครงการอื่น ซึ่งเราดวงดี(ไม่จริง)โดนตัดไปสัมภาษณ์กับอาจารย์ผู้หญิงที่สัมภาษณ์โครงการอื่น แล้วพี่เขาก็เรียกไปที่โต๊ะสัมภาษณ์</p>
                <div className='flex flex-col gap-2 text-lg'>
                    <p>:เชิญแนะนำตัวค่ะ</p>
                    <p className='text-right ml-16'>ผมชื่อ xxx ชื่อเล่น xxx อยู่ชั้นมัธยมศึกษาปีที่6 โรงเรียนเบ็ญจะมะมหาราช มาจากจังหวัดอุบลราชธานีครับ:</p>
                    <p className='italic text-gray-700 text-lg my-8'>อาจารย์ก็หยิบพอร์ตไปดูแล้วก็ถามว่าผลงานไหนเด็ดสุด เราเลยเปิดหน้าโอลิมปิก สอวน.ให้อาจารย์ดู แล้วก็แนะนำอาจารย์</p>
                    <p>:แล้วโอลิมปิกได้เหรียญอะไร</p>
                    <p className='italic text-gray-700 text-lg my-8'>ตอนนั้นคือช็อค โดนอาจารย์จี้ปม เพราะว่าค่อนข้างคาดหวังกับเหรียญโอลิมปิกมากแต่ไม่ได้ เลยตอบอาจารย์ว่าไม่ได้ครับ แต่ปีล่าสุดเกือบได้เหรียญทองแดง</p>
                    <p className='italic text-gray-700 text-lg my-8'>แล้วก็ถามเกี่ยวกับผลงานในพอร์ตว่าทำอะไรยังไง มีหน้าที่อะไร เราก็ตอบไปปกติเลย แต่ถามจี้ลงลึกสุดๆ เช่นถามว่า โปรเจคที่ทำใช้ algorithm อะไร</p>
                    <p>:ทำไมถึงอยากเข้าที่นี่</p>
                    <p className='text-right ml-10'>เราก็ตอบไปว่าด้วยชื่อเสียงของที่นี่ที่เด่นด้านเทคโนโลยี แล้วก็มีรุ่นพี่เรียนอยู่ที่นี่เยอะ เพื่อนก็อยากเข้าที่นี่เยอะ เลยอยากเรียนที่นี่:</p>
                    <p>:หลักสูตรของที่นี่ต่างจากที่อื่นยังไง</p>
                    <p className='italic text-gray-700 text-lg my-8'>อันนี้ช็อตไปเลยตอบไม่ได้5645466 เลยตอบไปว่า ไม่ค่อยแน่ใจเลยว่าต่างกันยังไงครับ  อาจารย์ก็อุตส่าห์ใจดีเปลี่ยนคำถามให้</p>
                    <p>:ทำไมไม่ยื่นวิศวะคอม</p>
                    <p className='text-right ml-10'>ชอบด้าน Software มากกว่าครับ:</p>
                    <p>:จบไปอยากทำอะไร</p>
                    <p className='text-right ml-10'>อยากต่อโทสายบริหาร อยากทำธุรกิจส่วนตัวเกี่ยวกับคอมพิวเตอร์ครับ:</p>
                    <p>:มีดูที่อื่นที่ไหนไว้บ้าง</p>
                    <p className='text-right ml-10'>บางมด กับ เกษตรครับ:</p>
                    <p>:แล้วอยากได้ที่ไหนที่สุด</p>
                    <p className='text-right ml-10'>ลาดกระบังครับ!:</p>
                    <p>:มาจากที่ไหนนะ</p>
                    <p className='text-right ml-10'>อุบลครับ:</p>
                    <p>:งั้นต้องให้แล้วแหละ</p>
                    <p className='italic text-gray-700 text-lg'>ตอนนั้นในใจคือ ห้ะ อะไรนะ เลยหรออาจารย์564655</p>
                    <p>:เรียบร้อยแล้วค่ะ</p>
                    <p className='italic text-red-700 text-lg'>* บอกก่อนว่าโอลิมปิกคอมพิวเตอร์ปีล่าสุดที่จะถึงนี้จัดที่ สจล.พอดี</p>
                    <p className='my-8'>เราเลยถามอาจารย์ว่าอาจารย์พอจะทราบเกี่ยวกับโอลิมปิกคอมพิวเตอร์ปีที่จะถึงมั้ย แล้วก็ถามว่าถ้าผมได้เรียนที่นี่จริงๆ จะสามารถมาช่วยเหลืองานอาจารย์ได้บ้างมั้ย(บอกเลยว่าอันนี้ท่าไม้ตาย เตรียมมานานมากก)</p>
                    <p>:แต่มันจัดช่วงพฤษภา ตอนนั้นเรายังไม่เปิดเทอมเลยนะ</p>
                    <p className='text-right ml-16'> ถ้าอาจารย์มีอะไรให้ช่วยเหลือก็ติดต่อได้เลยนะครับเพราะว่าผมแข่งมา2ปีน่าจะมีประสบการณ์ที่พอจะช่วยเหลืออาจารย์ได้บ้าง:</p>
                    <p className='my-8'>แล้วก็จบการสัมภาษณ์ด้วยการลุกจากเก้าอี้แล้วบอกอาจารย์ว่า ผมอยากเรียนที่นี่จริงๆครับอาจารย์ แล้วอาจารย์ก็ขำ</p>
                </div>
                <p className='text-lg'>จบการสัมภาษณ์ วิทย์คอม KMITL ครับผม</p>
                <p className='text-lg'>08/11/67: ไม่ผ่านสัมภาษณ์นะครับ อาจารย์ให้ความหวังทำไมT-T</p>
            </div>
            <Footer />
        </div>
    )
}

