import Navbar from '../../components/Navbar'
import Footer from '../../components/Footer'
import Image from 'next/image'

export default function BlogKMITL() {
    return (
        <div className='font-sarabun'>
            <Navbar />
            <div className='flex flex-col mx-5 xl:mx-80 lg:mx-40 md:mx-20 py-10 gap-5'>
                <h1 className='font-bold text-3xl pt-4'>รีวิวสัมภาษณ์ วิศวะคอมจุฬา(หลักสูตร CEDT) #dek68</h1>
                <p className='text-sm pb-2'>แก้ไขล่าสุด 19 ม.ค. 2568</p>
                <p className='text-lg'>สวัสดีครับ วันนี้มารีวิวสัมภาษณ์วิศวะคอมจุฬา(หลักสูตร CEDT) ที่เพิ่งไปสัมภาษณ์มา เรายื่นในรอบพอร์ตของสาขาเลย ผลงานที่ตรงเกณฑ์ก็มี ผู้แทนศูนย์สอวน.ทั้ง 2 ปี</p>
                <Image alt='' src="https://i.ibb.co/Xy5XW9f/IMG-0920-2.jpg" width={2000} height={2000} />
                <p className='text-lg'>วันสัมภาษณ์คือวันที่ 7 มกราคม มันยังอยู่ในช่วงปีใหม่ซึ่งรถบัสกับเครื่องบินเต็มเร็วมากก เลยติดสินใจจองรถบัสก่อนที่จะประกาศผลผู้มีสิทธิ์สัมภาษณ์! คือกลัวไม่ผ่านมั้ยก็กลัวแต่กลัวไม่มีรถไปสัมภาษณ์มากกว่า55555 พอถึงวันประกาศผู้มีสิทธิ์สัมภาษณ์ก็มีชื่ออยู่ถือว่าโล่งไป</p>
                <p className='text-lg'>พอถึงวันที่ 6 ก็เดินทางตอนเที่ยงเลย ถึงดึกๆ ก็ไปกินข้าวแล้วก็เข้าที่พักปกติ เราพักที่ ihouse ตอนเช้าจะได้เดินทางไปคณะได้สะดวก เพราะมีแยกเป็น 2 รอบคือรอบเช้ากับรอบบ่าย เราได้สัมภาษณ์รอบเช้า</p>
                <p className='text-lg'>เช้ามาก็ไปที่คณะเลย คนเยอะมาก แล้วก็ขึ้นไปที่ห้องรับรองเซ็นต์ชื่อก่อนเข้าห้อง เข้าไปก็นั่งเป็นโต๊ะแยกตามชุดที่สัมภาษณ์ มีแจกเบรค McDonald&apos;s เป็นเบอร์เกอร์กับพายด้วย  ส่วนใหญ่ก็มีแต่เด็กโอลิมปิกแล้วก็ที่เจอตามงานแข่งต่างๆ นึกว่าวันรวมญาติ555555</p>

                <div>
                    <Image src="https://i.ibb.co/KwTYxf8/IMG-3588-2.jpg" width={2000} height={2000} alt="Screenshot-2567-11-11-at-17-21-21" />
                    <p className='text-center text-gray-600 text-sm'>คิวสัมภาษณ์แล้วก็บรรยาการในห้องรับรอง</p>
                </div>


                <p className='text-lg'>พอโดนเรียกก็เดินไปรอห้องสัมภาษณ์ ห้องสัมภาษณ์เป็นห้องโถงใหญ่แยกโต๊ะกันเป็นชุดๆ ก่อนไปต่อคิวสัมภาษณ์ก็จะมีการตรวจเอกสารก่อน โต๊ะที่เราสัมภาษณ์มีอาจารย์ 2 ท่าน เป็นผู้ชายกับผู้หญิง ก็จะมีเก้าอี้ให้นั่งต่อคิวสัมภาษณ์ พอถึงคิวก็เดินไปที่โต๊ะเลย</p>
                <div className='flex flex-col gap-4 text-lg'>
                    <p>อจผช: เชิญนั่งเลยครับ</p>
                    <p className='short-description'>แล้วก็จะมีใบให้เซ็นต์ชื่อที่โต๊ะสัมภาษณ์</p>
                    <p>อจผช: แนะนำตัวได้เลยครับ</p>
                    <p className='my-speech'>ชื่อนาย xxx ชื่อเล่น xxx มาจากโรงเรียนเบ็ญจะมะมหาราช จังหวัดอุบลราชธานีครับ:</p>
                    <p>อจผช: เราเป็นผู้แทนศูนย์ สอวน.ใช่ไหม</p>
                    <p className='my-speech'>ใช่ครับ ผู้แทนศูนย์ม.อุบล 2 ปีครับ:</p>
                    <p>อจผช: ไหนลองเล่าโจทย์ในค่ายแล้วก็ประสบการณ์ในค่ายให้อาจารย์ฟังหน่อย</p>
                    <p className='short-description'>ก็อธิบายเกี่ยวกับค่ายแล้วก็โจทย์ในค่ายที่ทำไม่ได้ จนถึงขั้นทำไปด้วยกินข้าวไปด้วยแล้วอาจารย์ก็ขำ พร้อมกับบอกว่าผ่านโจทย์ข้อนั้นมาได้ยังไง</p>
                    <p>อจผช: คิดว่าการใช้ Dijkstra&apos;s algorithm กับ คิดแบบปกติที่ใช้ Common Sense ต่างกันยังไง</p>
                    <p className='my-speech'>ต่างกันที่เวลาครับ การใช้ Common Sense นับจะต้องนับทุกวิธีทุกทาง แต่การใช้ Dijkstra&apos;s จะเป็นการคิดไปในทางเดียว:</p>
                    <p>อจผช: นึกว่าจะตอบว่า Dijkstra&apos;s ก็ Common Sense ครับ55555</p>
                    <p>อจผญ: มาเรียนที่นี่จะพักที่ไหน</p>
                    <p className='my-speech'>ดูๆ ไว้ก็มี ihouse ครับ ที่พักเมื่อคืนนี้:</p>
                    <p>อจผญ: ที่บ้านส่งไหวมั้ยแล้วมีปัญหาด้านการเงินอะไรมั้ย</p>
                    <p className='my-speech'>ที่บ้านส่งไหวครับไม่มีปัญหา:</p>
                    <p>อจผช: มีอะไรจะถามอาจารย์มั้ย</p>
                    <p className='my-speech'>อยากรู้ช่องทางการต่อโทที่ต่างประเทศครับว่าปกติแล้วเป็นยังไง พอดีไม่เคยรู้มาก่อนเลยครับ:</p>
                    <p className='short-description'>อาจารย์ก็อธิบายการสมัครการยื่นอะไรแบบนี้แล้วก็แนะนำว่าให้ทำวิจัยเพิ่ม</p>
                    <p className='short-description'>แล้วอาจารย์ผู้ชายเปิดพอร์ตไปเรื่อยๆ จนกระทั่งเจอรูปที่ร้องเพลง</p>
                    <p>อจผญ: ร้องเพลงด้วยหรอเห็นแวบๆ</p>
                    <p className='short-description'>อาจารย์ผู้ชายบอกตาไวมาก แล้วทั้งโต๊ะก็ขำไปสักพัก</p>
                    <p>อจผช: ไหนลองอธิบายเทคนิคการร้องเพลงมา 1 เทคนิค</p>
                    <p className='short-description'>ก็เลยอธิบายเกี่ยวกับการออกเสียงแต่ละประเภท Chest, Mixed, Head ให้อาจารย์ฟัง</p>
                    <div>
                        <Image src="https://www.singbetter.net/images/chest-voice-head-voice.jpg" width={2000} height={2000} alt="Screenshot-2567-11-11-at-17-21-21" />
                        <p className='text-center text-gray-600 text-sm'>ภาพประกอบการออกเสียง (singbetter.net)</p>
                    </div>
                    <p>อจผช: อธิบายในเชิงฟิสิกส์ได้ไหม5555</p>
                    <p className='my-speech'>Chest voice เป็นเสียงที่มาจากหน้าอกครับ ช่องเสียงจะใหญ่กว่าช่องอื่นๆ ทำให้มีความถี่ต่ำ กลับกัน Head voice เสียงมาจากหัว แถวๆจมูก ทำให้ช่องเสียงเล็กแล้วก็ขึ้นเสียงสูงได้ง่ายกว่าครับ:</p>
                    <p>อจผญ: แล้วผู้ชายกับผู้หญิงร้องต่างกันมั้ย</p>
                    <p className='my-speech'>ต่างกันครับ โดยธรรมชาติผู้ชายจะเสียงต่ำกว่าทำให้ขึ้นเสียงสูงได้ยากกว่าผู้หญิง แต่บางคนก็ทำได้ครับ:</p>
                    <p>อจผญ: เรามีชมรมร้องเพลงด้วยนะสนใจมั้ย</p>
                    <p className='my-speech'>มีสนใจชมรมยิงปืนด้วยครับ เริ่มสนใจตั้งแต่งานโอลิมปิกครั้งที่แล้ว:</p>
                    <p>อจผช: ชอบนักกีฬาเกาหลีหรือตุรกี55555</p>
                    <p className='my-speech'>ชอบตุรกีครับ5555:</p>
                    <p className='short-description'>จากนั้นก็ขำไปสักพักก่อนที่จะจบการสัมภาษณ์</p>
                    <p>อจผช: ไม่น่ามีอะไรแล้วแหละ เรียบร้อยแล้วครับ</p>
                    <p className='my-speech'>ขอความกรุณาด้วยนะครับอาจารย์ จุฬาคนแรกของบ้านครับ:</p>
                    <p>อจผญ: จริงหรออ ยินดีกับที่บ้านด้วยนะ ตั้งใจเรียนอย่าให้ที่บ้านผิดหวังนะ</p>
                    <p className='short-description'>เราก็ขอบคุณอาจารย์แล้วก็ลุกออกมา</p>
                </div>
                <p className='text-lg'>แล้วก็จบสัมภาษณ์ไปด้วยดี อาจารย์ใจดีมาก อารมณ์ดี คุยสนุกสุดๆ หลังสัมภาษณ์เสร็จเราก็ไปเปลี่ยนชุดแล้วก็เดินเล่นใน ม.ต่อ จบการรีวิวสัมภาษณ์รีวิวสัมภาษณ์ วิศวะคอมจุฬา(หลักสูตร CEDT) ครับ</p>
                <p className='text-lg'>16/1/68: ผ่านสัมภาษณ์แล้วครับ</p>
                <div>
                    <Image className='border' src="https://i.ibb.co/sHcX3dk/Screenshot-2568-01-19-at-20-50-26.png" width={2000} height={2000} alt="Screenshot-2567-11-11-at-17-21-21" />
                    <p className='text-center text-gray-600 text-sm'>แปะรูป</p>
                </div>
            </div>
            <Footer />
        </div>
    )
}

